# LAB 04 - Data Preprocessing 2

## 3. 정렬, 필터링

### #01. 준비작업

In [4]:
# 1. 라이브러리 참조:
from hossam import load_data

In [5]:
# 2. 데이터 불러오기:
origin = load_data('grade')
origin

[data] https://data.hossam.kr/data/common/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### #02. 데이터 정렬

In [6]:
# 1. 변수에 의한 정렬: .sort_values()
# - 원본에 즉시 반영해야 할 경우는 inplace = True 옵션 넣기
# - ascending = False 파라미터는 내림차순 정렬임
#   (기본값 = True, 오름차순)
단일정렬df = origin.sort_values('학년', ascending=False)
단일정렬df

    학년  성별  국어   영어  수학  과학
이름
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
수현   3  여자  63   60  31  71
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
철수   1  남자  98   77  88  64
민철   1  남자  92   70  83  79
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [9]:
# 2. 여러 변수 정렬할 때:
# - 정렬기준이 되는 컬럼 이름을 리스트로 설정하면 첫 번째
#   컬럼값이 동일한 경우 두 번째 컬럼을 기준으로 정렬함
# - 각 변수에 대한 정렬 옵션 역시 리스트로 설정해야됨
복수정렬df = origin.sort_values(
    ['학년', '국어'],
    ascending = [False, False]
)
복수정렬df

    학년  성별  국어   영어  수학  과학
이름
영호   4  남자  80   88  91  72
호영   4  남자  75   50  90  88
수현   3  여자  63   60  31  71
영희   2  여자  88  120  62  72
용식   2  남자  82   88  79  90
철수   1  남자  98   77  88  64
민철   1  남자  92   70  83  79
석영   1  남자  91   90  89  80
나영   1  여자  90   92  81  95

In [10]:
# 3. 인덱스 기준으로 정렬하는 방법: .sort_index()
# - 인덱스는 하나만 존재하므로 열 이름을 지정할 필요 없음
# - 정렬 방향을 위한 ascending 파라미터를 False로 설정하면 
#   내림차순으로 정렬됨
# - inplace = True를 적용하면 원본에 즉시 반영됨
인덱스정렬df = origin.sort_index(ascending=False)
인덱스정렬df

    학년  성별  국어   영어  수학  과학
이름
호영   4  남자  75   50  90  88
철수   1  남자  98   77  88  64
용식   2  남자  82   88  79  90
영희   2  여자  88  120  62  72
영호   4  남자  80   88  91  72
수현   3  여자  63   60  31  71
석영   1  남자  91   90  89  80
민철   1  남자  92   70  83  79
나영   1  여자  90   92  81  95

### #03. 데이터 필터링

In [ ]:
# 1. 행 단위 필터링 (조건검색): .query(): 

# 1) 특정 조건에 맞는 행 조회방법 - 숫자 타입:
# 자격증에서 제시하는 방법:
#r1 = origin[origin['국어'] > 80]
r1 = origin.query('국어 > 80')  # .query(): 내장함수 기능임
r1

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [12]:
# 2) 특정 조건에 맞는 행 조회방법 - 문자열 타입:
# 자격증에서 제시하는 방법:
#r2 = origin[origin['성별'] == '남자']
r2 = origin.query("성별 == '남자'")
    # # 문자열임을 구분하기 위해 겉: ''면 안의 문자열: ""로 ㄱ
r2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
호영   4  남자  75  50  90  88
영호   4  남자  80  88  91  72
용식   2  남자  82  88  79  90
석영   1  남자  91  90  89  80

In [13]:
# 3) AND 조건:
# 자격증에서 제시하는 방법:
#r3 = origin[(origin['국어'] > 80) & (origin['수학'] > 80)]
r3 = origin.query('국어 > 80 and 수학 > 80')
r3

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
민철   1  남자  92  70  83  79
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

In [14]:
# 4) OR 조건:
# 자격증에서 제시하는 방법:
#r3 = origin[(origin['국어'] <= 80) | (origin['수학'] <= 80)]
r4 = origin.query('국어 <= 80 or 수학 <= 80')
r4

    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90

In [15]:
# 5) 조건값을 변수로 적용하는 방법:
    # @변수이름 형태로 조건식에 포함하면 됨
point = int(input('점수를 입력하시오:'))
print("국어 점수가 %d점 보다 높은 학생" % point)

r5 = origin.query('국어 > @point')
r5

국어 점수가 82점 보다 높은 학생

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

In [16]:
# 2. 열 단위 필터링
# 변수 갯수에 따른 함수 선택 기준:
# 취할 거 < 버릴 거 : .filter([ , ])
# 취할 거 > 버릴 거 : .drop()
fl = origin.filter(['국어', '영어'])
fl

    국어   영어
이름
철수  98   77
영희  88  120
민철  92   70
수현  63   60
호영  75   50
영호  80   88
용식  82   88
나영  90   92
석영  91   90